<!DOCTYPE html>
<html dir="rtl">
<title>آموزش لاراول</title>
<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" href="https://www.w3schools.com/w3css/4/w3.css">
<link href="{{ URL::to('assets/css/app.css') }}" rel="stylesheet" id="bootstrap-css">
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/4.7.0/css/font-awesome.min.css">
<style>
.w3-theme {color:#fff !important;background-color:#3366ff !important}
.w3-btn {background-color:#4CAF50;margin-bottom:4px}
.w3-code{border-left:4px solid #4CAF50}
.myMenu {margin-bottom:150px}

.topnav {
  overflow: hidden;
  background-color: #3366ff;
}

.topnav a {
  float:right;
  display: block;
  color: white;
  text-align: center;
  padding: 1px 20px;
  text-decoration: none;
  font-size: 14px;
}

.topnav a:hover {
  background-color: #ddd;
  color: white;
}

.topnav a.active {
  background-color: #fff;
  color: white;
  padding: 1px 20px;
}

.topnav .search-container {
  float: left;
}

.topnav input[type=text] {
  padding: 9px;
  margin-top: 20px;
  font-size: 22px;
  border: none;
}

.topnav .search-container button {
  float: right;
  padding: 9px 10px;
  margin-top: 20px;
  margin-right: 6px;
  background: #000;
  font-size: 22px;
  border: none;
  cursor: pointer;
}
.search-container  {
  float: right;
  padding: 15px 15px;
  margin-top: 6px;
  margin-right: 15px;
  background: #3366ff;
  font-size: 22px;
  border: none;
  cursor: pointer;
}


.topnav .search-container button:hover {
  background: #000;
}

@media screen and (max-width: 600px) {
  .topnav .search-container {
    float: none;
  }
  .topnav a, .topnav input[type=text], .topnav .search-container button {
    float: none;
    display: block;
    text-align: right;
    width: 100%;
    margin: 0;
    padding: 14px;
  }
  .topnav input[type=text] {
    border: 1px solid #ccc;  
  }
}
table {
  border-collapse: collapse;
  width: 100%;
}

th, td {
  padding: 8px;
  text-align: center;
  border-bottom: 1px solid #ddd;
}

tr:hover {background-color: #3366ff;}


<style>
/* unvisited link */
a:link {
  color: red;
}

/* visited link */
a:visited {
  color: light blue;
}

/* mouse over link */
a:hover {
  color: black;
}

/* selected link */
a:active {
  color: blue;
}
</style>
</style>
<body>

<!-- Top -->
<!-- Top -->

  
  
</div>

<div class="topnav">
<table >

<td>
    <td><a href="http://laraway.ir" class="active" href="#home">

<svg xmlns="http://www.w3.org/2000/svg" width="46" height="46" fill="currentColor" class="bi bi-boxes" viewBox="0 0 16 16" id="IconChangeColor"> <path d="M7.752.066a.5.5 0 0 1 .496 0l3.75 2.143a.5.5 0 0 1 .252.434v3.995l3.498 2A.5.5 0 0 1 16 9.07v4.286a.5.5 0 0 1-.252.434l-3.75 2.143a.5.5 0 0 1-.496 0l-3.502-2-3.502 2.001a.5.5 0 0 1-.496 0l-3.75-2.143A.5.5 0 0 1 0 13.357V9.071a.5.5 0 0 1 .252-.434L3.75 6.638V2.643a.5.5 0 0 1 .252-.434L7.752.066ZM4.25 7.504 1.508 9.071l2.742 1.567 2.742-1.567L4.25 7.504ZM7.5 9.933l-2.75 1.571v3.134l2.75-1.571V9.933Zm1 3.134 2.75 1.571v-3.134L8.5 9.933v3.134Zm.508-3.996 2.742 1.567 2.742-1.567-2.742-1.567-2.742 1.567Zm2.242-2.433V3.504L8.5 5.076V8.21l2.75-1.572ZM7.5 8.21V5.076L4.75 3.504v3.134L7.5 8.21ZM5.258 2.643 8 4.21l2.742-1.567L8 1.076 5.258 2.643ZM15 9.933l-2.75 1.571v3.134L15 13.067V9.933ZM3.75 14.638v-3.134L1 9.933v3.134l2.75 1.571Z" id="mainIconPathAttdibute" fill="#ff0000" stdoke="#ffffff" stdoke-width="0.5"></path> </svg>

</a></td>
    </td>
    <div class="w3-bar w3-theme w3-large" style="z-index:4;">

    

</td>
</td> 
</td> </td>
 <td>
<td>    <a class="w3-bar-item w3-button w3-left w3-hide-large w3-hover-white w3-large w3-theme w3-padding-16" href="javascript:void(0)" onclick="w3_open()">
<svg xmlns="http://www.w3.org/2000/svg" width="52" height="52" fill="currentColor" class="bi bi-list" viewBox="0 0 16 16" id="IconChangeColor"> <path fill-rule="evenodd" d="M2.5 12a.5.5 0 0 1 .5-.5h10a.5.5 0 0 1 0 1H3a.5.5 0 0 1-.5-.5zm0-4a.5.5 0 0 1 .5-.5h10a.5.5 0 0 1 0 1H3a.5.5 0 0 1-.5-.5zm0-4a.5.5 0 0 1 .5-.5h10a.5.5 0 0 1 0 1H3a.5.5 0 0 1-.5-.5z" id="mainIconPathAttribute" fill="#ffffff"></path> </svg>
</a>
</td>
</td>
</div>
  <td>
    <td><a class="w3-bar-item w3-button w3-hide-medium w3-hide-small w3-hover-white w3-padding-16" href="#">LARAWAY</a></td>
    </td>
    <td>
    <td><a class="w3-bar-item w3-button w3-hide-medium w3-hide-small w3-hover-white w3-padding-16" href="#">LARAVEL</a></td>
    </td>
    <td>
    <td><a class="w3-bar-item w3-button w3-hide-medium w3-hide-small w3-hover-white w3-padding-16" href="#">HTML</a></td>
    </td>
    <td>
    <td><a class="w3-bar-item w3-button w3-hide-medium w3-hide-small w3-hover-white w3-padding-16" href="#">CSS</a></td>
    </td>
    <td>
    <td><a class="w3-bar-item w3-button w3-hide-medium w3-hide-small w3-hover-white w3-padding-16" href="#">JAVA SCRIPT</a></td>
    </td>
    <td>
    <td><a class="w3-bar-item w3-button w3-hide-medium w3-hide-small w3-hover-white w3-padding-16" href="#">DOCKER DESKTOP</a></td>
    </td> <td>
    <td><a class="w3-bar-item w3-button w3-hide-medium w3-hide-small w3-hover-white w3-padding-16" href="#">GIT</a></td>
    </td> <td>
    <td><a class="w3-bar-item w3-button w3-hide-medium w3-hide-small w3-hover-white w3-padding-16" href="#">GIT HUB</a></td>
    </td> <td>
    <td><a class="w3-bar-item w3-button w3-hide-medium w3-hide-small w3-hover-white w3-padding-16" href="#">PHP</a></td>
    </td>
    </td>
   
</div>
   
  </td>
 
</table>
  
 
</div>

<!-- Sidebar -->
<div class="w3-sidebar w3-bar-block w3-collapse " style="z-index:3;width:300px margin-right:10px;"dir="rtl">
    <div class="w3-bar w3-hide-large w3-large">
    </div>
    <a href="javascript:void(0)" onclick="w3_close()" class="w3-button w3-right w3-xlarge w3-hide-large" title="Close Menu">×</a>
    <div id="menuTut" class="myMenu">
        <div class="w3-container">
          <div id="menuTut" class="myMenu">
            <div class="w3-container">
               <h3 dir="rtl">آموزش لاراول</h3>
            
            <a class="w3-button" href="/http://laraway.ir/laravel"> ایجاد اولین صفحه در لاراول</a>
 
               <h3 dir="rtl">آموزش HTML</h3>
            <a class="w3-button" href='/tags/default.asp'>تایپ فارسی در HTML</a>
 
          </div>
        </div>
    </div>
  </div>
  
            

<!-- Overlay effect when opening sidebar on small screens -->
<div class="w3-overlay w3-hide-large" onclick="w3_close()" style="cursor:pointer" title="close side menu" id="myOverlay"></div>
</div>

<!-- Main content: shift it to the right by 270 pixels when the sidebar is visible -->

<div class="w3-main w3-container" style="margin-left:10px;margin-top:3px;margin-right:330px;">
  
    <div class="w3-panel w3-padding-large w3-card-4 w3-light-grey">
      <a href="#"> 
        <div class="search-container">
          <form action="/action_page.php">
            <button type="submit"><i class="fa fa-search"></i></button>
            <input type="text" placeholder="جستجو..." name="search">
          </form>
        </div>
      </a>
    </div>
<div class="w3-panel w3-padding-large w3-card-4 w3-light-grey">

<p dir="rtl">

<h1>به چه زبان‌هایی اسکریپتی گفته می‌شود؟</h1>
<br>
  زبان‌های اسکریپتی اصلا چرا و برای رفع چه نیازی به وجود آمدند؟ 

مدت‌ها قبل، برنامه نویسان برای نوشتن یک برنامه مثل مرورگر اینترنت، پخش کننده ویدیو یا … باید ابتدا حجم زیادی از کد را می‌نوشتند و سپس با کامپایل کردن کدها یک فایل خروجی نهایی (مثل exe. در ویندوز) تولید می‌کردند. این فایل به مشتری نهایی تحویل داده می‌شد. معمولا بعد از مدتی، نیاز به ایجاد تغییر یا به روزرسانی باعث می‌شد تا برنامه نویس تصمیم بگیرد تغییراتی در برنامه ایجاد کند.

در چنین شرایطی، برنامه نویس باید سراغ کدها می‌رفت و بعد از ایجاد تغییرات، فایل خروجی نهایی را تولید می‌کرد. 
<br>
<br>
  اما اگر کاربر آن نرم افزار می‌خواست تغییری را ایجاد کند، عملا هیچ راهکاری پیش پای او وجود نداشت، چرا که کدهای نرم افزار فقط در اختیار برنامه‌نویس یا شرکت سازنده بود.

حال اگر کاربر یا برنامه نویس میتوانست کمی راحت‌تر و بدون درگیر شدن با کدهای پیچیده و کامپایل کردن، تغییراتی در برنامه ایجاد کند؛ امکان توسعه نرم افزارها با سرعت بیشتری فراهم می‌شد. 
<br> 
<br>
 فرض کنید با استفاده از یک ویرایشگر متن امکان اصلاح کدها و دریافت خروجی نهایی وجود داشت. ایده ی به وجود آمدن زبان های اسکریپتی همین بوده است. <br> <br>  به آن فایل متنی «اسکریپت» می گویند و آن زبان ساده و نزدیک به زبان انسان هم «زبان اسکریپتی» نام دارد.
 
<br>
<br>
<h3> تفاوت کامپایلر و مفسر چیست؟</h3>

زبان های اسکریپتی نوعی از زبان های برنامه نویسی هستند که نیاز به مرحله ی کامپایل شدن ندارند بلکه باید تفسیر شوند.
<br>
<br>  
به عبارتی زبان های اسکریپتی برای اجرا نیاز به مفسر (interpreter) دارند در حالی که دیگر زبان های برنامه نویسی به کامپایلر نیاز دارند <br>
<br>  اگر بخواهیم فرق بین مفسر با کامپایلر را بدانیم، ابتدا باید بدانیم که کامپایلر چیست؟ <br>

کامپیوترها فهمی از زبان‌های برنامه نویسی ندارند وفقط زبان ماشین (تشکیل شده از صفر و یک) را اجرا می کنند. کامپایلر زبان های سطح بالا (مانند Java و #C) را به زبان ماشین تبدیل می کند <br> <br> مفسر هم دقیقا مانند کامپایلر زبان های اسکریپتی را به زبان ماشین تبدیل کرده و اجرا می کند.

البته مفسر کل برنامه را یک جا به کد ماشین تبدیل نمی کند بلکه خط به خط این کار را انجام می دهد <br> <br> به عبارت دیگر، مفسر اسکریپت نوشته شده را تحویل گرفته و خطوط کد را به ترتیب و یکی پس از دیگری خوانده، به زبان ماشین ترجمه نموده و سپس اجرا می کند. هنگامی که یک خط از کد اجرا شد، همین روند تا رسیدن به انتهای اسکریپت ادامه پیدا می کند. <br>
<h2>تفاوت بین زبان های برنامه نویسی و اسکریپت نویسی</h2>

زبان های اسکریپتی و برنامه نویسی با یکدیگر تفاوت هایی دارند که در این نوشته فقط به مهم ترین موارد اشاره می کنیم. <br> البته به یاد داشته باشید که تفاوت بین آن ها رو به محو شدن است و روز به روز از اهمیت آن کم می شود.
دلیل این امر هم پیشرفت سریع سخت افزار و افزایش شدید سرعت پردازش است. دلیل دیگر آن است که ابزارهای نرم افزاری امروزی مانند کتابخانه ها، کامپایلرها و مفسرها نیز بسیار پیشرفته تر شده اند.
<br>
فایل خروجی
در زبان های برنامه نویسی پس از کامپایل شدن برنامه، در مرحله ی ساختن (build) یک فایل خروجی اجرایی تولید می شود. این فایل عملا یک پکیج فشرده شده شامل کدهای ماشین است. فرمت این فایل خروجی به پلتفرم هدف ربط دارد. مثلا اگر قرار باشد برنامه در سیستم عامل ویندوز اجرا شود فرمت فایل خروجی exe. خواهد بود. <br>

ببینم  آموزش ارسال ایمیل با پایتون (به وسیله جیمیل)
در مورد زبان‌های اسکریپتی این فایل اجرایی وجود ندارد. تمام خطوط کد درون یک فایل متنی تحت عنوان اسکریپت نوشته می شوند. مثلا درمورد جاوا اسکریپت این فایل دارای فرمت js. و در پایتون درای فرمت py. است. وقتی یک وب سایت را در مرورگر باز می کنید فایل js. توسط مرورگر دانلود می شود و سپس مفسر موجود در مرورگر آن را تفسیر کرده و اجرا می کند.

سرعت اجرا
به طور کلی زبان های برنامه نویسی سریع تر هستند چون از قبل کامپایل شده اند و خطاهای موجود در برنامه رفع شده اند. هم چنین خطوط برنامه از قبل تبدیل به کدهای ماشین شده است و مستقیما توسط پردازش گر اجرا می شوند.
در مورد زبان های اسکریپت نویسی، هر بار که مفسر اسکریپت را می خواند کدها را خط به خط و از ابتدا بررسی می کند، سپس کامپایل کرده و در نهایت اجرا می نماید. همچنین هنگامی که در اجرای یکی از خطوط خطایی رخ دهد، برنامه متوقف می شود.

نحوه ی اجرا
در زبان های برنامه نویسی فایل اجرایی خروجی برای اجرا شدن نیاز به نرم افزار خاصی ندارد و به طور مستقل اجرا می شود. در زبان های اسکریپت نویسی، اسکریپت برای اجرا شدن نیاز به نرم افزارهای دیگری دارد. مثلا اسکریپت های php برای اجرا نیاز به وب سرور یا مرورگر دارند.

ویژگی های برجسته زبان‌های اسکریپتی
یادگیری زبان‌های اسکریپتی نسبتاً آسان تر است و مدت زمان کمتری نیاز دارد.
کدنویسی و توسعه ی نرم افزار با این زبان ها ساده تر است و زمان کمتری را می طلبد.
انتقال و اجرای اسکریپت در سیستم عامل های مختلف به راحتی انجام می شود.
تغییر دادن و اصلاح کد راحت تر صورت می گیرد.
برای اهداف متن باز (open source) بسیار مناسب است
برخی از کاربردهای زبان های اسکریپت نویسی
یکی از کاربردهای گسترده زبان‌های اسکریپتی در اپلیکیشن های وب است. این زبان ها هم در سمت سرور و هم در سمت کلاینت کاربرد فراونی دارند. در سمت سرور از زبان های جاوااسکریپت، php ،‌ پایتون ، perl و … استفاده می شود. زبان پرکاربرد سمت کلاینت نیز جاوااسکریپت است.
یکی دیگر از کاربردهای این زبان ها در زمینه ی مدیریت سیستم و سرور است. در این زمینه از زبان های shell، perl، پایتون و … استفاده می شود.
این زبان ها در نوشتن پلاگین و افزونه برای نرم افزارهای موجود نیز به کار برده می شوند.
بازی سازی، مالتی مدیا و استخراج داده از دیتاست ها از دیگر زمینه هایی هستند که زبان های اسکریپت نویسی در آن ها به کار گرفته می شوند.
تعدادی از زبان‌های اسکریپتی
این که آیا یک زبان اسکریپتی است یا خیر، کاملا بستگی به شیوه ی پیاده سازی آن زبان و محیط اجرای کدها در آن زبان دارد. ما می توانیم برای هر زبانی که بخواهیم یک کامپایلر و یا یک مفسر طراحی کنیم. اگر آن زبان از طریق مفسر اجرا شود و فایل اجرایی نیز نداشته باشد اسکریپتی است و اصطلاحاً به آن «مفسری» نیز می گویند.
اگر همان زبان از طریق کامپایلر کامپایل شود و یک فایل اجرایی به ما تحویل داده شود، دیگر اسکریپتی نیست و اصطلاحاً به آن زبان «کامپایلری» می گویند. در ادامه با چند مورد از زبان‌های اسکریپتی پرکاربرد را مرور می‌کنیم.

جاوااسکریپت
این زبان را می توان یکی از جزءهای اصلی حوزه ی توسعه ی وب دانست. ابتدا از این زبان برای پویاتر کردن صفحات وب استفاده می شد ولی اکنون بسیار فراتر از گذشته است. این روزها تقریباً تمامی قسمت های فرانت اند بر اساس این زبان نوشته می شود. همچنین از زبان جاوااسکریپت می توان در قسمت بک اند و سمت سرور نیز استفاده کرد. از دیگر کاربردهای این زبان می توان به حوزه های اپلیکیشن موبایل، اپلیکیشن دسکتاپ، توسعه ی بازی و اینترنت اشیاء نیز اشاره کرد.

ببینم  خاموش کردن کامپیوتر با پایتون - ویندوز، لینوکس و رزبری پای + ویدیو
البته اخیراً در رابطه با اسکریپتی بودن زبان جاوا اسکریپت اختلافاتی وجود دارد. دلیل این اختلاف نظرها نیز وجود موتورهایی مانند V8 است که به همراه مرورگرها ارائه شده اند. نحوه ی اجرای کدهای جاوااسکریپت در این موتورها گاهاً شبیه به زبان های کامپایلری است. ولی هنوز هم در اکثر جاها جاوااسکریپت یک زبان اسکریپتی نامیده می شود و اکثر برنامه نویسان نیز این حرف را قبول دارند.

پایتون
زبان پایتون با استفاده از مفسر بر روی تمامی پلتفرم ها مانند ویندوز، لینوکس،‌ مک او اس و … قابل اجراست. پایتون زبانی سطح بالا و دارای کدهایی خوانا و آسان است. این زبان در کنار سادگی در استفاده و اجرا، از قدرت بالایی نیز برخوردار است. از زبان پایتون می توان در حوزه های مختلف مانند حوزه ی توسعه ی وب، یادگیری ماشین، هوش مصنوعی، تحقیقات علمی، توسعه ی بازی و‌ اپلیکیشن های دسکتاپ استفاده کرد.

PHP
زبان برنامه نویسیPHP‌  یک زبان بک اند است که در سمت سرور اجرا می شود. هم اکنون حدود ۸۰ درصد از وب سایت های دنیا از زبان PHP استفاده کرده اند. سیستم های مدیریت محتوای معروفی مانند وردپرس، جوملا و دروپال با این زبان نوشته شده اند.

Perl
زبانِ نسبتاً معروف Perl یک زبان اسکریپتی و دارای ویژگی هایی خلاقانه است. در سرورها از این زبان برای کاربردی هایی مثل پردازش متون، گزارش گیری و … استفاده می شود. وبسایت های پر ترافیکی مانند IMDB از زبان Perl نیز استفاده کرده اند.

اینم از یک مقاله تقریبا مفصل دیگه. امروز سعی کردیم شما رو با مفهوم اسکریپت بیشتر آشنا کنیم. بعید میدونم دیگه مشکلی در درک مفهوم اسکریپت داشته باشید. اما اگه سوالی یا نظری دارید همین پایین کامنت کنید. یادتون نره که این نظرات شماست که باعث میشه ما هر روز بهتر از قبل براتون محتوا تولید کنیم. خوش و خرم باشید. 🙂

آیا این مطلب برای شما مفید بود؟
</p>
               </div>
               

<script>
// Script to open and close the sidebar
function w3_open() {
  document.getElementById("mySidebar").style.display = "block";
  document.getElementById("myOverlay").style.display = "block";
}
 
function w3_close() {
  document.getElementById("mySidebar").style.display = "none";
  document.getElementById("myOverlay").style.display = "none";
}

function w3_show_nav(name) {
  document.getElementById("menuTut").style.display = "none";
  document.getElementById("menuRef").style.display = "none";
  document.getElementById(name).style.display = "block";
  w3-open();
}
</script>

<script src="https://www.w3schools.com/lib/w3codecolor.js"></script>

<script>
w3CodeColor();
</script>

</body>
</html>
